{
  "case_id": "case_5_9",
  "title": "Sudden Hearing Loss and Facial Paralysis (Bell's Palsy)",
  "demographics": {
    "age_years": 75,
    "sex": "male",
    "primary_language": "English",
    "country_region": "USA"
  },
  "chief_complaint": "I lost hearing and movement in the left side of my face suddenly about two years ago. I haven't seen any improvement, and I'm having trouble communicating.",
  "problem_summary": {
    "onset": "Sudden onset approximately 2 years ago.",
    "course": "Stable; no reported improvement in facial paralysis or hearing loss since onset.",
    "laterality": "Left side symptoms (facial and hearing), though testing reveals bilateral hearing loss.",
    "associated_symptoms": "Left facial paralysis (Bell's palsy). Denies tinnitus or dizziness.",
    "functional_impact": "Communication difficulty due to hearing loss.",
    "goals_motivation": "Seeking evaluation for communication difficulties."
  },
  "encounters": [
    {
      "visit_id": "V1",
      "date": "2014-05-06",
      "setting": "Audiology Clinic",
      "history": {
        "present_illness": "75-year-old male reports sudden hearing loss and facial paralysis on the left side 2 years ago. Diagnosed with Bell's palsy. No improvement noted.",
        "otologic_history": "No history of familial hearing loss or otosurgery. Denies tinnitus or dizziness.",
        "noise_exposure_history": "Worked in an automotive plant for 37 years; hearing protection used consistently only later in his career.",
        "medical_psych_history": "History of multiple 'ministrokes' (TIAs) over a 1-year period; last known event 5 years ago.",
        "prior_management": "No hearing test prior to this visit.",
        "patient_goals": "Address communication difficulties."
      },
      "tests": [
        {
          "name": "Pure-tone audiometry",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": "unaided",
          "sources": [
            "text",
            "image"
          ],
          "figure_refs": [
            "Fig. 5.9"
          ],
          "key_findings": "Bilateral sensorineural hearing loss. Right ear shows normal hearing at 250 Hz sloping to moderate-severe high-frequency loss. Left ear shows normal hearing at 250 Hz sloping to moderate-severe loss, generally worse than the right (asymmetric).",
          "numeric_results": {
            "Right_AC_Thresholds": "250Hz: 15, 500Hz: 30, 1000Hz: 35, 2000Hz: 40, 4000Hz: 45, 8000Hz: 65 dB HL",
            "Left_AC_Thresholds": "250Hz: 15, 500Hz: 30, 1000Hz: 45, 2000Hz: 50, 4000Hz: 55, 8000Hz: 70 dB HL",
            "Bone_Conduction": "Consistent with air conduction (Sensorineural)"
          }
        },
        {
          "name": "Speech audiometry",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": "unaided",
          "sources": [
            "text",
            "image"
          ],
          "figure_refs": [
            "Fig. 5.9"
          ],
          "key_findings": "SRT scores are consistent with pure-tone averages. Word recognition is excellent in the right ear and good in the left ear.",
          "numeric_results": {
            "Right_SRT": "30 dB HL",
            "Right_WRS": "92% at 75 dB HL",
            "Left_SRT": "43 dB HL",
            "Left_WRS": "84% at 85 dB HL"
          }
        },
        {
          "name": "Tympanometry",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": "unaided",
          "sources": [
            "text",
            "image"
          ],
          "figure_refs": [
            "Fig. 5.9"
          ],
          "key_findings": "Normal Type A tympanograms bilaterally.",
          "numeric_results": {
            "Right_Static_Admittance": "0.30 mL",
            "Right_Pressure": "-25 daPa",
            "Left_Static_Admittance": "0.40 mL",
            "Left_Pressure": "-20 daPa"
          }
        },
        {
          "name": "Acoustic reflexes",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": "unaided",
          "sources": [
            "text",
            "image"
          ],
          "figure_refs": [
            "Fig. 5.9"
          ],
          "key_findings": "Right ipsilateral and left contralateral (probe right) reflexes are present. Left ipsilateral and right contralateral (probe left) reflexes are absent. This pattern (absent when probe is in left ear) is consistent with left facial nerve pathology (Bell's palsy).",
          "numeric_results": {
            "Right_Ipsi": "Present (90 dB)",
            "Left_Ipsi": "Absent",
            "Right_Contra_Probe_Left": "Absent",
            "Left_Contra_Probe_Right": "Present (90-95 dB)"
          }
        }
      ]
    }
  ],
  "overall_audiologic_summary": "The patient presents with bilateral, asymmetric sensorineural hearing loss, sloping from normal in the low frequencies to moderately severe in the high frequencies, with the left ear showing greater thresholds. Speech recognition remains good bilaterally. Tympanometry is normal, but acoustic reflexes are absent when the probe is in the left ear, consistent with the reported history of left-sided Bell's palsy (facial nerve paralysis).",
  "counseling_points": [
    "Your hearing test shows hearing loss in both ears, but it is slightly worse in your left ear.",
    "The 'missing' reflexes in your left ear are a direct result of the Bell's palsy you experienced, as the facial nerve controls the muscle we measure in this test.",
    "Because there is a difference between your ears (asymmetry), I am referring you to an otologist for medical clearance.",
    "Following medical clearance, we should discuss hearing aids to help with the communication difficulties you are experiencing.",
    "Even though you are retired, continue to protect your hearing if you are around loud noises (lawnmowers, power tools)."
  ],
  "notes_for_actor": [
    "Portray a patient who has resigned himself to the facial paralysis but is frustrated that communication is getting harder.",
    "You do not have dizziness or ringing in your ears.",
    "You are cooperative but may ask if the hearing loss is going to get worse like the facial paralysis did."
  ]
}