{
  "case_id": "Case008",
  "ranked_differential_diagnosis": [
    {
      "rank": 1,
      "label": "Acoustic Neuroma (Vestibular Schwannoma)",
      "rationale_short": "Confirmed by MRI showing a 2.95 x 2.4 cm tumor on the left CP angle; consistent with unilateral tinnitus, high-frequency asymmetry, abnormal TEN test, and absent ABR Wave V."
    },
    {
      "rank": 2,
      "label": "Retrocochlear Lesion",
      "rationale_short": "Initial suspicion raised by unilateral tinnitus and slight high-frequency asymmetry; strongly supported by cochlear dead regions on TEN test and absent ABR Wave V."
    },
    {
      "rank": 3,
      "label": "Subclinical Processing Abnormality",
      "rationale_short": "Considered initially due to normal pure-tone thresholds and difficulty in noise, but ruled out by identification of the tumor."
    }
  ],
  "investigations_and_interpretations": {
    "ordered_list": [
      {
        "action": "Otoscopy",
        "urgency": "routine",
        "rationale_short": "To inspect the ear canals and tympanic membranes for visible pathology."
      },
      {
        "action": "Pure-tone audiometry",
        "urgency": "routine",
        "rationale_short": "To assess hearing sensitivity; revealed clinically normal thresholds with slight left-sided high-frequency asymmetry."
      },
      {
        "action": "Speech audiometry",
        "urgency": "routine",
        "rationale_short": "To assess speech recognition thresholds, which aligned with pure tone averages."
      },
      {
        "action": "Tympanometry",
        "urgency": "routine",
        "rationale_short": "To evaluate middle ear function; results were normal (Type A) bilaterally."
      },
      {
        "action": "Otoacoustic Emissions (TEOAE)",
        "urgency": "routine",
        "rationale_short": "To assess outer hair cell function; robust emissions were present bilaterally."
      },
      {
        "action": "Tinnitus Assessment",
        "urgency": "routine",
        "rationale_short": "To characterize the reported tinnitus; pitch-matched to 1.5 kHz in the left ear."
      },
      {
        "action": "TEN (Threshold Equalizing Noise) Test",
        "urgency": "soon",
        "rationale_short": "To assess for cochlear dead regions or neural dysfunction given the unilateral symptoms; revealed abnormalities in the left ear."
      },
      {
        "action": "Auditory Brainstem Response (ABR)",
        "urgency": "soon",
        "rationale_short": "To screen for retrocochlear pathology; revealed absence of Wave V in the left ear."
      },
      {
        "action": "MRI",
        "urgency": "urgent",
        "rationale_short": "Definitive imaging to confirm retrocochlear pathology; revealed a large acoustic neuroma."
      }
    ],
    "expected_interpretations_by_visit": [
      {
        "visit_id": "V1",
        "collective_interpretation": "The patient presented with normal hearing sensitivity but significant functional complaints (unilateral tinnitus, difficulty in noise). While basic audiometry and OAEs were normal, slight high-frequency asymmetry prompted further investigation. The TEN test indicated neural dysfunction/dead regions, and ABR showed retrocochlear signs (absent Wave V). MRI subsequently confirmed a large left acoustic neuroma compressing the brainstem.",
        "tests": [
          {
            "name": "Otoscopy",
            "category": "Physical Exam",
            "result_summary": "Clear ear canals and intact tympanic membranes bilaterally."
          },
          {
            "name": "Pure-tone audiometry",
            "category": "Audiometry",
            "result_summary": "Normal thresholds bilaterally; left ear slightly worse (10-20 dB HL) than right (0-10 dB HL) at 2000, 4000, and 8000 Hz."
          },
          {
            "name": "Speech audiometry",
            "category": "Audiometry",
            "result_summary": "SRTs in quiet were 15 dB HL (right) and 20 dB HL (left), consistent with pure tone averages."
          },
          {
            "name": "Tympanometry",
            "category": "Immittance",
            "result_summary": "Type A tympanograms bilaterally."
          },
          {
            "name": "Otoacoustic Emissions (TEOAE)",
            "category": "OAE",
            "result_summary": "Robust emissions in both ears."
          },
          {
            "name": "Tinnitus Assessment",
            "category": "Tinnitus",
            "result_summary": "High-pitched tinnitus matched to 1.5 kHz."
          },
          {
            "name": "TEN (Threshold Equalizing Noise) Test",
            "category": "Specialized Audiometry",
            "result_summary": "Abnormal results in the left ear at 1, 1.5, 3, and 4 kHz suggesting inner hair cell/neural dysfunction; right ear normal."
          },
          {
            "name": "Auditory Brainstem Response (ABR)",
            "category": "Electrophysiology",
            "result_summary": "Right ear normal; Left ear showed absence of wave V at 70 dBnHL."
          },
          {
            "name": "MRI",
            "category": "Imaging",
            "result_summary": "Large acoustic neuroma (2.95 x 2.4 cm) on the left CP angle compressing the brainstem and VIIIth cranial nerve."
          }
        ]
      }
    ]
  },
  "treatment_and_management": {
    "proposed_items": [
      "Referral to neurotologist for management of acoustic neuroma",
      "Stereotactic radiosurgery (Gamma Knife) selected as treatment",
      "Effective communication strategies"
    ],
    "counseling_actions": [
      "Explanation that the tumor is causing the difficulty in noise and tinnitus despite normal pure-tone thresholds",
      "Discussion of management options including microsurgery, stereotactic radiation therapy, and stereotactic radiosurgery",
      "Counseling regarding potential worsening of hearing and tinnitus post-radiation"
    ]
  },
  "escalation_and_red_flags": {
    "red_flags_present": [
      "Unilateral tinnitus",
      "Sudden onset hearing difficulty",
      "Asymmetric hearing thresholds (slight)",
      "Loudness intolerance",
      "Abnormal TEN test results",
      "Absent ABR Wave V"
    ],
    "escalation": {
      "urgency": "urgent",
      "destination": "Neurotologist",
      "rationale_short": "Large acoustic neuroma compressing the brainstem requires specialist intervention."
    }
  },
  "follow_up_plan": {
    "timeline": "6 months after stereotactic radiosurgery",
    "objective": "Monitor hearing thresholds, tinnitus, and tumor response to treatment."
  },
  "expected_outcome": [
    "Otoscopy: Clear ear canals and intact tympanic membranes bilaterally.",
    "Tympanometry: Normal ear canal volumes, peak pressure, and static admittance bilaterally.",
    "Pure-tone audiometry (Right Ear): Thresholds within normal limits at all frequencies.",
    "Pure-tone audiometry (Left Ear): Mild sensorineural hearing loss from 1000 Hz through higher frequencies; asymmetry increased compared to initial visit.",
    "Hearing in Noise Test (HINT): Performance within normal percentiles for both quiet and noise front conditions.",
    "Subjective: Patient denied any worsening of tinnitus.",
    "Functional status: Bilateral functional hearing retained; amplification device not recommended."
  ]
}