{
  "case_id": "Case007_08",
  "ranked_differential_diagnosis": [
    {
      "rank": 1,
      "label": "Bilateral mixed hearing loss",
      "rationale_short": "Audiometric results show mixed hearing loss in both ears with significant air-bone gaps."
    },
    {
      "rank": 2,
      "label": "Chronic otitis media with Eustachian tube dysfunction",
      "rationale_short": "History of chronic otitis media, bilateral PE tubes, and tympanometric findings of negative pressure and large volumes."
    },
    {
      "rank": 3,
      "label": "Tympanic membrane perforation / Patent PE tube",
      "rationale_short": "Tympanometry reveals abnormally large ear canal volumes bilaterally, consistent with perforations or patent tubes."
    },
    {
      "rank": 4,
      "label": "History of Sudden Sensorineural Hearing Loss (Right Ear)",
      "rationale_short": "Patient reports a history of sudden hearing loss in the right ear one year ago that did not improve with treatment."
    }
  ],
  "investigations_and_interpretations": {
    "ordered_list": [
      {
        "action": "Pure-tone audiometry",
        "urgency": "routine",
        "rationale_short": "To determine the degree, type, and configuration of hearing loss."
      },
      {
        "action": "Speech audiometry",
        "urgency": "routine",
        "rationale_short": "To assess speech reception thresholds and word recognition ability."
      },
      {
        "action": "Tympanometry",
        "urgency": "routine",
        "rationale_short": "To assess middle ear status, specifically checking for perforations or patent PE tubes."
      }
    ],
    "expected_interpretations_by_visit": [
      {
        "visit_id": "V1",
        "collective_interpretation": "The patient presents with bilateral mixed hearing loss, more severe in the right ear which also exhibits reduced speech recognition (likely sequelae of prior SSNHL). The left ear retains excellent speech recognition. Tympanometry reveals large ear canal volumes bilaterally, confirming patent PE tubes or tympanic membrane perforations, with excessive negative pressure noted in the right ear.",
        "tests": [
          {
            "name": "Pure-tone audiometry",
            "result_summary": "Right ear: Mild mixed loss (250-500 Hz) sloping to severe mixed (8000 Hz). Left ear: Mild-to-moderate mixed loss (250-2000 Hz), rising to mild mixed (3000-4000 Hz), sloping to moderate-to-severe (6000-8000 Hz). Significant air-bone gaps bilaterally."
          },
          {
            "name": "Speech audiometry",
            "result_summary": "Right ear: SRT 60 dB, WRS 62% (moderate difficulty). Left ear: SRT 47 dB, WRS 96% (normal ability)."
          },
          {
            "name": "Tympanometry",
            "result_summary": "Right ear: Large ear canal volume (5.6 mL) with excessive negative pressure (-270 daPa). Left ear: Large ear canal volume (3.3 mL), flat (Type B). Consistent with perforation or patent PE tubes."
          }
        ]
      }
    ]
  },
  "treatment_and_management": {
    "proposed_items": [
      "Hearing aid evaluation",
      "Hearing Assistive Technology (HAT)",
      "Hearing protection in noise",
      "Keep ears dry (water precautions)"
    ],
    "counseling_actions": [
      "Discuss the mixed nature of the hearing loss",
      "Explain the status of PE tubes and tympanic membrane perforations",
      "Advise on water precautions to prevent middle ear infection"
    ]
  },
  "escalation_and_red_flags": {
    "red_flags_present": [],
    "escalation": {
      "urgency": "routine",
      "destination": "Otologist",
      "rationale_short": "For continued management of chronic otitis media, tympanic membrane perforations, and clearance for amplification."
    }
  },
  "follow_up_plan": {
    "timeline": "Annual",
    "objective": "Hearing test to monitor hearing status."
  },
  "expected_outcome": []
}