{
  "case_id": "case_12_12",
  "ranked_differential_diagnosis": [
    {
      "rank": 1,
      "label": "Right Conductive Hearing Loss (Blocked PE Tube / Recurrent OME)",
      "rationale_short": "Tympanometry shows normal equivalent volume (0.7) with a flat trace, indicating a blocked tube or fluid behind an intact drum. Combined with reported drainage and mild-to-moderate hearing loss, this suggests the tube is non-functional and pathology has recurred."
    },
    {
      "rank": 2,
      "label": "Left Normal Hearing (Patent PE Tube)",
      "rationale_short": "Tympanometry shows large equivalent volume (3.9) with a flat trace, consistent with a patent (open) PE tube. Audiometric thresholds are within normal limits."
    }
  ],
  "investigations_and_interpretations": {
    "ordered_list": [
      {
        "action": "Otoscopy",
        "urgency": "routine",
        "rationale_short": "To visually confirm the presence of drainage, assess the status of the PE tubes, and check for obstruction."
      },
      {
        "action": "Tympanometry",
        "urgency": "routine",
        "rationale_short": "To assess the patency of the PE tubes by measuring equivalent ear canal volume."
      },
      {
        "action": "Pure-tone and Speech Audiometry",
        "urgency": "routine",
        "rationale_short": "To quantify the degree of hearing loss in the right ear and confirm normal hearing in the left."
      }
    ],
    "expected_interpretations_by_visit": [
      {
        "visit_id": "V1",
        "collective_interpretation": "Results indicate a functioning PE tube in the left ear with normal hearing, but a non-functioning (blocked) PE tube in the right ear associated with conductive hearing loss and active drainage.",
        "tests": [
          {
            "name": "Tympanometry",
            "category": "Immittance",
            "result_summary": "Right: Type B with normal volume (0.7 mmhos), suggesting blocked tube. Left: Type B with large volume (3.9 mmhos), suggesting patent tube."
          },
          {
            "name": "Pure-tone audiometry",
            "category": "Audiometry",
            "result_summary": "Right: Mild-to-moderate conductive hearing loss (PTA 35 dB HL). Left: Normal hearing (PTA 10 dB HL)."
          },
          {
            "name": "Speech audiometry",
            "category": "Audiometry",
            "result_summary": "Right: SRT 30 dB HL, WRS 100% @ 85 dB HL. Left: SRT 10 dB HL, WRS 100% @ 45 dB HL."
          }
        ]
      }
    ]
  },
  "treatment_and_management": {
    "proposed_items": [
      "Referral to ENT for management of right ear otorrhea and blocked PE tube.",
      "Medical management likely to include antibiotic ear drops or tube replacement.",
      "Monitor left ear status."
    ],
    "counseling_actions": [
      "Explain that the left tube is working well and hearing is normal on that side.",
      "Inform the parent that the right tube appears blocked, causing the fluid buildup, drainage, and temporary hearing loss.",
      "Reassure that the hearing loss in the right ear is conductive and likely temporary pending medical treatment."
    ]
  },
  "escalation_and_red_flags": {
    "red_flags_present": [
      "Right ear drainage (otorrhea)",
      "Fluctuating attention/hearing",
      "Blocked PE tube"
    ],
    "escalation": {
      "urgency": "routine",
      "destination": "Otolaryngologist (ENT)",
      "rationale_short": "Medical intervention is required to treat the active drainage and address the non-functioning PE tube in the right ear."
    }
  },
  "follow_up_plan": {
    "timeline": "Post-medical management (approx. 2-4 weeks)",
    "objective": "To confirm resolution of the conductive component in the right ear and ensure the tube is patent or the ear is aerated."
  },
  "expected_outcome": [
    "Resolution of right ear drainage with medical treatment.",
    "Improvement of right ear hearing thresholds to normal levels following clearance of effusion or tube replacement.",
    "Continued normal function of the left ear."
  ]
}