{
  "case_id": "case_69",
  "title": "Somatic Tinnitus",
  "demographics": {
    "age_years": 57,
    "sex": "female",
    "primary_language": null,
    "country_region": "USA"
  },
  "chief_complaint": "My ringing in the left ear and ear pain have gotten much worse over the past two weeks. The pain shoots up when I use a cotton swab or touch my jaw, and the ringing changes pitch or gets louder when I move my head or open my mouth.",
  "problem_summary": {
    "onset": "Tinnitus present for approximately 1 year; exacerbated in the last 2 weeks.",
    "course": "Become more bothersome recently without apparent reason; fluctuates throughout the day.",
    "laterality": "Left-sided tinnitus and otalgia; bilateral hearing loss.",
    "associated_symptoms": "Otalgia (ear pain), neck and upper back discomfort, previous episodes of vertigo, anxiety, depression.",
    "functional_impact": "Severe/catastrophic handicap (THI score 78/100); sleep disturbance and anxiety.",
    "goals_motivation": "Seeking relief from increased tinnitus and ear pain."
  },
  "encounters": [
    {
      "visit_id": "V1",
      "date": null,
      "setting": "Tinnitus Management Clinic (TMC)",
      "history": {
        "present_illness": "Patient reports increased left-sided tinnitus and otalgia (pain 5/10). Pain increases with cotton swab use or touching TMJ area. Tinnitus quality is 'cricket-like' but changes pitch/loudness with head position, jaw movement, and stress.",
        "otologic_history": "Prior ENT workup including physical exam and MRI were normal. History of vertigo.",
        "noise_exposure_history": "Not specified.",
        "medical_psych_history": "Neck/upper back discomfort. Prescribed 0.5 mg alprazolam for tinnitus/anxiety. Moderate to severe depression and anxiety indicated on screening.",
        "prior_management": "Seen by otolaryngologist to rule out medical/surgical pathology.",
        "patient_goals": "Management of tinnitus and pain."
      },
      "tests": [
        {
          "name": "Pure-tone audiometry",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": "unaided",
          "sources": [
            "text"
          ],
          "figure_refs": [],
          "key_findings": "Normal hearing sensitivity through 2000 Hz sloping to a mild high-frequency sensorineural hearing loss bilaterally.",
          "numeric_results": null
        },
        {
          "name": "Speech audiometry",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": "unaided",
          "sources": [
            "text"
          ],
          "figure_refs": [],
          "key_findings": "Normal ability to receive and recognize speech.",
          "numeric_results": {
            "SRT_right": "15 dB HL",
            "SRT_left": "15 dB HL",
            "WRS_right": "Normal (NU-6)",
            "WRS_left": "Normal (NU-6)"
          }
        },
        {
          "name": "Tympanometry",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": null,
          "sources": [
            "text"
          ],
          "figure_refs": [],
          "key_findings": "Normal pressure, ear canal volume, and static compliance.",
          "numeric_results": null
        },
        {
          "name": "Acoustic reflexes",
          "timepoint_label": "Baseline",
          "ear": "bilateral",
          "condition": null,
          "sources": [
            "text"
          ],
          "figure_refs": [],
          "key_findings": "Present at expected levels; negative reflex decay at 1000 Hz.",
          "numeric_results": null
        },
        {
          "name": "Self-report scales",
          "timepoint_label": "Baseline",
          "ear": null,
          "condition": null,
          "sources": [
            "text",
            "image"
          ],
          "figure_refs": [
            "Table 69.1"
          ],
          "key_findings": "Scores indicate severe tinnitus handicap, moderate-to-severe depression, and moderate anxiety.",
          "numeric_results": {
            "THI_score": "78/100",
            "PHQ-9_score": "19",
            "GAD-7_score": "11",
            "Pain_scale": "5/10"
          }
        },
        {
          "name": "Somatic/Physical Assessment",
          "timepoint_label": "Baseline",
          "ear": "left",
          "condition": null,
          "sources": [
            "text",
            "image"
          ],
          "figure_refs": [
            "Table 69.1"
          ],
          "key_findings": "Tinnitus loudness/pitch modulates with jaw movement (clenching, opening), neck rotation, and palpation of masseter muscle trigger points (MTPs). Palpation also reproduces ear pain. Left C1 malrotation noted.",
          "numeric_results": null
        }
      ]
    }
  ],
  "overall_audiologic_summary": "The patient presents with normal low-to-mid frequency hearing sloping to a mild high-frequency sensorineural hearing loss bilaterally. Speech recognition is excellent. The primary finding is Somatic Tinnitus, evidenced by the modulation of tinnitus loudness and pitch during jaw and neck maneuvers, and the reproduction of otalgia upon palpation of masseter muscle trigger points. There is significant associated psychological distress (anxiety/depression).",
  "counseling_points": [
    "Your tinnitus is 'somatic,' meaning it is connected to the muscles and nerves in your jaw and neck, not just your ears.",
    "The pain you feel in your ear is likely 'referred pain' coming from tight muscles in your jaw (masseter muscle).",
    "Stress and anxiety can cause you to clench your jaw, which tightens these muscles and makes the tinnitus worse.",
    "We recommend a team approach: a dental splint to help your jaw, physical therapy for your neck and posture, and relaxation techniques to lower your stress levels.",
    "Avoid 'hard chewy' foods and gum to give your jaw muscles a rest."
  ],
  "notes_for_actor": [
    "Portray a patient who is anxious and distressed by the ringing.",
    "When the clinician asks you to move your jaw or turn your head, report that the ringing gets louder or changes pitch.",
    "If the clinician touches your jaw area (masseter), wince slightly and say it hurts your ear.",
    "Mention that the ringing sounds like crickets but changes often."
  ]
}