{
  "case_id": "Case036",
  "ranked_differential_diagnosis": [
    {
      "rank": 1,
      "label": "Right unilateral peripheral vestibular dysfunction",
      "rationale_short": "Ice water calorics and rotational chair testing revealed distinct right-sided weakness, despite initial bithermal results suggesting bilateral loss due to central inhibition."
    },
    {
      "rank": 2,
      "label": "Bilateral peripheral vestibular dysfunction",
      "rationale_short": "Suggested by initial bithermal caloric weakness and DVAT results, but ruled out by asymmetry on ice water and rotational chair tests."
    },
    {
      "rank": 3,
      "label": "Perilymphatic fistula",
      "rationale_short": "Previous diagnosis; unlikely given lack of improvement with surgical exploration and packing."
    },
    {
      "rank": 4,
      "label": "Benign Paroxysmal Positional Vertigo (BPPV)",
      "rationale_short": "Ruled out by negative Dix-Hallpike maneuver and lack of response to repositioning maneuvers."
    }
  ],
  "investigations_and_interpretations": {
    "ordered_list": [
      {
        "action": "Clinical Vestibular Exam",
        "urgency": "routine",
        "rationale_short": "Initial assessment of oculomotor function and VOR including HIT and Dix-Hallpike."
      },
      {
        "action": "Dynamic Visual Acuity (DVAT)",
        "urgency": "routine",
        "rationale_short": "To assess functional VOR and oscillopsia symptoms."
      },
      {
        "action": "Posturography (Clinical/Foam)",
        "urgency": "routine",
        "rationale_short": "To evaluate sensory integration for balance, specifically somatosensory dependence."
      },
      {
        "action": "Bithermal Caloric Irrigation",
        "urgency": "routine",
        "rationale_short": "Standard assessment of individual labyrinthine function."
      },
      {
        "action": "Ice Water Caloric Irrigation",
        "urgency": "routine",
        "rationale_short": "Performed to verify residual function when bithermal responses are weak or absent."
      },
      {
        "action": "Rotational Chair (RC)",
        "urgency": "routine",
        "rationale_short": "To evaluate VOR gain and phase across frequencies and detect asymmetry."
      },
      {
        "action": "cVEMP",
        "urgency": "routine",
        "rationale_short": "To assess saccular and inferior vestibular nerve function."
      }
    ],
    "expected_interpretations_by_visit": [
      {
        "visit_id": "V1",
        "collective_interpretation": "The patient presented with symptoms and initial caloric findings mimicking bilateral vestibular loss. However, ice water calorics and rotational chair testing revealed a distinct right unilateral peripheral vestibular dysfunction. The initial bilateral appearance was attributed to central inhibition (cerebellar clamping) of the intact left side.",
        "tests": [
          {
            "name": "Clinical Vestibular Exam",
            "category": "Bedside Exam",
            "result_summary": "Normal oculomotor exam; negative Dix-Hallpike. Positive Head Impulse Test (HIT) in the right horizontal plane."
          },
          {
            "name": "Dynamic Visual Acuity (DVAT)",
            "category": "Functional",
            "result_summary": "Markedly reduced; >7 lines lost (normal <2), consistent with oscillopsia."
          },
          {
            "name": "Posturography (Clinical/Foam)",
            "category": "Balance",
            "result_summary": "Increased sway with eyes closed; fell with delayed response on foam with eyes closed."
          },
          {
            "name": "Bithermal Caloric Irrigation",
            "category": "Vestibular",
            "result_summary": "Bilaterally reduced responses with a total eye speed of 12°/s."
          },
          {
            "name": "Ice Water Caloric Irrigation",
            "category": "Vestibular",
            "result_summary": "Marked asymmetry: Right response 3°/s, Left response 37°/s."
          },
          {
            "name": "Rotational Chair (RC)",
            "category": "Vestibular",
            "result_summary": "Decreased low-frequency VOR gain with phase lead; asymmetry with clockwise (rightward) rotations weaker than counterclockwise."
          },
          {
            "name": "cVEMP",
            "category": "Vestibular",
            "result_summary": "Normal thresholds bilaterally (Left 85 dB nHL, Right 90 dB nHL)."
          }
        ]
      }
    ]
  },
  "treatment_and_management": {
    "proposed_items": [
      "Vestibular rehabilitation therapy (VRT) for uncompensated unilateral dysfunction"
    ],
    "counseling_actions": [
      "Explain that the 'bilateral' weakness seen on initial tests was due to the brain clamping down on the good ear (central inhibition) to minimize asymmetry.",
      "Clarify that the true diagnosis is right unilateral weakness, as confirmed by ice water and rotational chair tests.",
      "Discuss the mechanism of oscillopsia (visual jiggling) as a failure of the VOR to stabilize vision during vibration.",
      "Counsel that since one ear is functioning, the patient is a good candidate for rehabilitation to promote compensation."
    ]
  },
  "escalation_and_red_flags": {
    "red_flags_present": [],
    "escalation": {
      "urgency": "routine",
      "destination": "Vestibular Rehabilitation Therapy",
      "rationale_short": "Referral for therapy to address uncompensated unilateral vestibular dysfunction."
    }
  },
  "follow_up_plan": {
    "timeline": "Ongoing",
    "objective": "Monitor progress in dynamic compensation during rehabilitation."
  },
  "expected_outcome": [
    "Patient is currently enrolled in a vestibular rehabilitation/retraining program.",
    "Patient is showing improvement in dynamic compensation."
  ]
}